In [1]:
import pandas as pd

In [9]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 22],
    'City': ['Delhi', 'Mumbai', 'Bangalore']
}
df = pd.DataFrame(data)

In [4]:
# ✅ Basic Info
df.head()       # First 5 rows
df.tail()       # Last 5 rows
df.info()       # Structure
df.describe()   # Statistics
df.shape        # Dimensions
df.columns      # Column names
df.index        # Row indexes
df.dtypes       # Data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

Name    object
Age      int64
City    object
dtype: object

In [5]:
# ✅ Selecting Columns & Rows
df['Name']
df[['Name', 'City']]
df.iloc[0]             # Row by index
df.loc[0]              # Row by label
df.at[0, 'City']
df.iat[0, 1]

25

In [6]:
# ✅ Add / Drop
df['Salary'] = [50000, 60000, 55000]
df.drop('Salary', axis=1)
df.drop(0, axis=0)

      Name  Age       City  Salary
1      Bob   30     Mumbai   60000
2  Charlie   22  Bangalore   55000

In [7]:
# ✅ Rename
df.rename(columns={'Name': 'FullName'}, inplace=True)

In [8]:
# ✅ Reset Index
df.reset_index(drop=True, inplace=True)